Test/Jerome_Test/ManageResourceInventory/IIS/xml/2-4_abn_notifygetAllManagedElementsWithBatchNotificationEvent.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:not="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1" xmlns:bn="http://www.tmforum.org/mtop/fmw/xsd/mepbn/v1" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xmlns:mep="http://www.tmforum.org/mtop/fmw/xsd/mep/v1" xmlns:mer="http://www.tmforum.org/mtop/mri/xsd/mer/v1" xmlns:me="http://www.tmforum.org/mtop/nrf/xsd/me/v1" xmlns:coi="http://www.tmforum.org/mtop/fmw/xsd/coi/v1" xmlns:gen="http://www.tmforum.org/mtop/fmw/xsd/gen/v1" xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:cri="http://www.tmforum.org/mtop/nrb/xsd/cri/v1" xmlns:lay="http://www.tmforum.org/mtop/nrb/xsd/lay/v1" xmlns:nt1="vendor.v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../../../Framework/IIS/xsd/NotificationMessagesV1-0.xsd http://www.tmforum.org/mtop/mri/xsd/mer/v1 ../xsd/ManagedElementRetrievalMessagesV1-0.xsd http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <wsa:RelatesTo>http://host:port/operation2222</wsa:RelatesTo>
  </soap:Header>
  <soap:Body>
    <not:notify>
      <not:topic>http://host:port/operation2222</not:topic>
      <not:message>
        <mer:getAllManagedElementsBatchEvent>
          <bn:sequence>1</bn:sequence>
          <bn:endOfReply>false</bn:endOfReply>
          <mer:getAllManagedElementsBatchData>
            <mer:meList>
              <me:me>
                <coi:name>
                  <nam:object>
                    <nam:type>mdNm</nam:type>
                    <nam:name>string</nam:name>
                  </nam:object>
                  <nam:object>
                    <nam:type>meNm</nam:type>
                    <nam:name>string</nam:name>
                  </nam:object>
                </coi:name>
                <coi:userLabel>string</coi:userLabel>
                <coi:discoveredName>string</coi:discoveredName>
                <coi:namingOS>string</coi:namingOS>
                <coi:owner>string</coi:owner>
                <coi:aliasNameList>
                  <gen:alias>
                    <gen:aliasName>string</gen:aliasName>
                    <gen:aliasValue>string</gen:aliasValue>
                  </gen:alias>
                </coi:aliasNameList>
                <cri:source>networkEMS</cri:source>
                <cri:networkAccessDomain>string</cri:networkAccessDomain>
                <cri:resourceState>INSTALLED</cri:resourceState>
                <me:location>string</me:location>
                <me:manufacturer>string</me:manufacturer>
                <me:productName>string</me:productName>
                <me:version>string</me:version>
                <me:InSyncState>true</me:InSyncState>
                <me:supportedRates>
                  <lay:layerRate>LR_Line_OC48_STS48_and_MS_STM16</lay:layerRate>
                  <lay:layerRate>LR_Line_OC192_STS192_and_MS_STM64</lay:layerRate>
                </me:supportedRates>
                <me:communicationState>CS_AVAILABLE</me:communicationState>
              </me:me>
              <me:me>
                <coi:name>
                  <nam:object>
                    <nam:type>mdNm</nam:type>
                    <nam:name>string</nam:name>
                  </nam:object>
                  <nam:object>
                    <nam:type>meNm</nam:type>
                    <nam:name>string</nam:name>
                  </nam:object>
                </coi:name>
                <coi:userLabel>string</coi:userLabel>
                <coi:discoveredName>string</coi:discoveredName>
                <coi:namingOS>string</coi:namingOS>
                <coi:owner>string</coi:owner>
                <coi:aliasNameList>
                  <gen:alias>
                    <gen:aliasName>string</gen:aliasName>
                    <gen:aliasValue>string</gen:aliasValue>
                  </gen:alias>
                </coi:aliasNameList>
                <cri:source>networkEMS</cri:source>
                <cri:networkAccessDomain>string</cri:networkAccessDomain>
                <cri:resourceState>INSTALLED</cri:resourceState>
                <me:location>string</me:location>
                <me:manufacturer>string</me:manufacturer>
                <me:productName>string</me:productName>
                <me:version>string</me:version>
                <me:InSyncState>true</me:InSyncState>
                <me:supportedRates>
                  <lay:layerRate>LR_Line_OC48_STS48_and_MS_STM16</lay:layerRate>
                  <lay:layerRate>LR_Line_OC192_STS192_and_MS_STM64</lay:layerRate>
                </me:supportedRates>
                <me:communicationState>CS_AVAILABLE</me:communicationState>
              </me:me>
            </mer:meList>
          </mer:getAllManagedElementsBatchData>
        </mer:getAllManagedElementsBatchEvent>
      </not:message>
    </not:notify>
  </soap:Body>
</soap:Envelope>
