Test/Jerome_Test/Framework/IIS/xml/10-1_srr_subscribeRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:not="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessagesV1-0.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/NotificationProducer</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/notp/v1-0/SubscribeRequest</wsa:Action>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <not:subscribeRequest>
      <not:consumerEpr>http://host:port/NotificationConsumer</not:consumerEpr>
      <not:topic>Inventory</not:topic>
    </not:subscribeRequest>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
