Test/Jerome_Test/Framework/IIS/xml/11_notify.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:not="http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1" xmlns:wsa="http://www.w3.org/2005/08/addressing" xmlns:cei="http://www.tmforum.org/mtop/fmw/xsd/cei/v1" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/ http://www.tmforum.org/mtop/fmw/xsd/notmsg/v1 ../xsd/NotificationMessagesV1-0.xsd">
  <SOAP-ENV:Header>
    <wsa:To>http://host:port/NotificationConsumer</wsa:To>
    <wsa:Action>http://www.tmforum.org/mtop/fmw/wsdl/notc/v1-0/notify</wsa:Action>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body>
    <not:notify>
      <not:topic>Inventory</not:topic>
      <not:message>
        <cei:commonEventInfo>
          <cei:notificationId>123</cei:notificationId>
          <cei:osTime>2001-12-17T09:30:47.0Z</cei:osTime>
          <cei:vendorExtensions/>
        </cei:commonEventInfo>
      </not:message>
    </not:notify>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
